#Задание 1

print('Введите стороны прямоугольника:')
a, b = map(float, input().split())
s = (a * b) // 2
p = (a + b) * 2
print('Площадь прямоугольника:', s, 'Периметр прямоугольника:', p)

#Задание 2

num = int(input())
a = num % 10
b = num % 100 // 10
c = num % 1000 // 100
d = num % 10000 // 1000
e = num // 10000
print((b ** a) * c / (e - d))